
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/9604506502)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_49a22bd6c2c404a722d71e73946fa9e3.zip" -> "functions/src_8b2934e5e3c5a1dd9f2dbc1abda9e96a.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_49a22bd6c2c404a722d71e73946fa9e3.zip" -> "functions/src_8b2934e5e3c5a1dd9f2dbc1abda9e96a.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_49a22bd6c2c404a722d71e73946fa9e3.zip" -> "functions/src_8b2934e5e3c5a1dd9f2dbc1abda9e96a.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "rlTXkw==" -> (known after apply)
      ~ detect_md5hash      = "SaIr1sLEBKci1x5zlG+p4w==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-deploy-functions/src_49a22bd6c2c404a722d71e73946fa9e3.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "SaIr1sLEBKci1x5zlG+p4w==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-deploy/o/functions%2Fsrc_49a22bd6c2c404a722d71e73946fa9e3.zip?generation=1718665764783515&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_49a22bd6c2c404a722d71e73946fa9e3.zip" -> "functions/src_8b2934e5e3c5a1dd9f2dbc1abda9e96a.zip" # forces replacement
      ~ output_name         = "functions/src_49a22bd6c2c404a722d71e73946fa9e3.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-deploy/o/functions%2Fsrc_49a22bd6c2c404a722d71e73946fa9e3.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1061,"Program":"tfcmt","SHA1":"a41290d7cdf54d046e6a0e53bf1939ac7ee0dbfb","Vars":{},"WorkflowName":"CI / Infrastructure Production"} -->